using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Задачи_из_файла
{
    internal class Programm
    {
        static void Main(string[] args)
        {
            /* 1) Вывести на экран число e(основание натурального логарифма) с точностью до десятых */
            Console.WriteLine("номер 1");
            Console.WriteLine("e = 2.7");

            /* 2) Вывести на экран числа 50 и 10 одно под другим */
            Console.WriteLine("номер 2");
            Console.WriteLine(50);
            Console.WriteLine(10);
            Console.ReadKey();

            /* 3) Составить программу вывода на экран «столбиком» четырех любых чисел */
            Console.WriteLine("номер 3");
            Console.WriteLine(""
        }
    }
}
